Documents/ОбзвонКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОбзвонКлиентов</Name>
			<Comment>Обзвон клиентов для контроля качества монтажей, по акциям</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОпроса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОбзвоновКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Монтаж</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйВыполнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаЗвонка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вопросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВопросОпроса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОбзвонКлиентов/Forms/ФормаСозданияПоМонтажам/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПодобратьМонтажи(Команда)
	Если НЕ ЗначениеЗаполнено(НачалоПериода) ИЛИ НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		Сообщить("Не указано начало или конец периода");	
		Возврат;
	КонецЕсли;
	ПодобратьМонтажиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодобратьМонтажиНаСервере()
	ТабЗнач.Очистить();
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументМонтаж.Ссылка КАК ДокументСсылка,
	|	ДокументМонтаж.Результат КАК Результат,
	|	ВЫБОР
	|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбзвонКлиентов.Ссылка) > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НаличиеОбзвонов
	|ИЗ
	|	Документ.Монтаж КАК ДокументМонтаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбзвонКлиентов КАК ОбзвонКлиентов
	|		ПО (ОбзвонКлиентов.Монтаж = ДокументМонтаж.Ссылка)
	|ГДЕ
	|	ДокументМонтаж.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|";
	
	Если ЗначениеЗаполнено(ОтборПоРезультату) Тогда 
		Запрос.Текст = Запрос.Текст + " И ДокументМонтаж.Результат = &Результат";
	КонецЕсли;	
	
	Запрос.Текст = Запрос.Текст + " СГРУППИРОВАТЬ ПО
	|	ДокументМонтаж.Ссылка,
	|	ДокументМонтаж.Результат";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Результат", ОтборПоРезультату);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если (НЕ ВключитьМонтажиСОбзвонами И НЕ Выборка.НаличиеОбзвонов) ИЛИ (ВключитьМонтажиСОбзвонами) Тогда 
			НоваяСтрокаТЗ = ТабЗнач.Добавить();
			НоваяСтрокаТЗ.Пометка = Истина;
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТЗ, Выборка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОбзвоны(Команда)
	Если НЕ ЗначениеЗаполнено(ВидОпроса) Тогда
		Сообщить("Не указан вид опроса для создаваемых обзвонов");	
		Возврат;
	КонецЕсли;
	Если ТабЗнач.Количество() = 0 Тогда
		Сообщить("Не выбраны монтажи");	
		Возврат;
	КонецЕсли;
	СоздатьОбзвоныНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьОбзвоныНаСервере()
	
	Для каждого Строка Из ТабЗнач Цикл	
		Если Строка.Пометка Тогда	
			НовыйОбзвон 						= Документы.ОбзвонКлиентов.СоздатьДокумент();
			НовыйОбзвон.Дата 					= ТекущаяДатаСеанса();
			НовыйОбзвон.Монтаж 					= Строка.ДокументСсылка;
			НовыйОбзвон.Контрагент 				= Строка.ДокументСсылка.Контрагент;
			НовыйОбзвон.ВидОпроса				= ВидОпроса;
			НовыйОбзвон.ПланируемаяДатаЗвонка 	= ПланируемаяДатаОбзвона;
			Документы.ОбзвонКлиентов.ЗаполнитьВопросыПоВидуОпроса(НовыйОбзвон);
			//Попытка
			НовыйОбзвон.Записать();
		КонецЕсли; 	
	КонецЦикла; 
	Сообщить("Обзвоны успешно созданы");
	
КонецПроцедуры
